Revit 2024 API
IExternalApplication Interface
An interface that supports addition of external applications to Revit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public interface IExternalApplication
Visual Basic
Public Interface IExternalApplication
Visual C++
public interface class IExternalApplication
Remarks
External applications are permitted to customize the Revit UI, and to add events and updaters to the session.
See Also
IExternalApplication Members
Autodesk.Revit.UI Namespace